Repository: luan-u/tvt-br-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: pt_br

source: * {{Stripperific}}: Audiences are meant to find a female warrior's outfit sexy first and foremost, and either not think about or not care about how impractical it would be in combat.
pt_br: * Br/{{Strippertastico}}: A primeira impressão do público sobre um traje de uma guerreira feminina deve ser de sensualidade, desconsiderando a falta de praticidade e utilidade em combate.

source: * {{Superhero}}: Parodies the genre.
pt_br: * Br/SuperHeroi: Uma paródia do gênero.

source: * {{Tomorrowland}}: A region considerably more technologically advanced than its neighbours; often without explanation.
pt_br: * Br/TerraDoAmanha: Uma região muito mais avançada tecnologicamente em relação aos seus vizinhos, geralmente sem explicação nenhuma.

source: * {{Transplant}}: Profesor Jirafales originated in the show "Los supergenios de la mesa cuadrada".
pt_br: * Br/{{Transplante}}: O professor Girafales se originou no show "Los supergenios de la mesa cuadrada".

source: * {{Tsundere}} * UnclePennybags: A wealthy person who often uses their fortune to help the needy and/or give those less fortunate than them a good time.
pt_br: * Br/{{Tsundere}} * Br/TioPennybags: Uma pessoa rica que costuma usar sua fortuna para ajudar os necessitados ou para dar a eles um momento agradável.

source: * {{Tsundere}}: ** Chilindrina, type B. She acts very nicely towards Chavo and Quico until either of them upsets her, at which point she can get really nasty.
pt_br: * Br/{{Tsundere}}: ** Chiquinha é do tipo B. Ela age de maneira gentil com o Chaves e o Quico até que um deles a irrita, e nesse momento ela fica realmente terrível.

source: * {{Tuckerization}}: ** Dudão is a nickname for Eduardo, which is also the name of the comic's creator.
pt_br: * Br/{{Tuckerizacao}}: ** Dudão é um apelido para Eduardo, que é o nome do criador das histórias.

source: * {{Uncancelled}}: The comic book was originally published by Editora Louvor in 1992, lasting only five issues, then did not release any new issues until 1995, under Editora Vida.
pt_br: * Br/{{Descancelado}}: Os quadrinhos eram originalmente publicados pela Editora Louvor em 1992, durando apenas cinco edições, e não receberam novas edições até 1995, pela Editora Vida.

source: * {{Undercity}}: A city that suffered some calamity has been built-over and forgotten -- but it's still there.
pt_br: * Br/CidadeSobACidade: Uma cidade que sofreu alguma calamidade e que foi reconstruída por cima, sendo esquecida com o tempo -- mas ela ainda está lá.

source: * {{Veganopia}}: Peaceful societies don't eat meat.
pt_br: * Br/{{Veganopia}}: Sociedades pacíficas não comem carne.

source: * {{Wacky Wayside Tribe}}s begin choking the plot to conceal the fact that the writers have basically run out of story.
pt_br: * A Br/EstradaComUmaTriboEstranha começa a sufocar a trama para ocultar o fato de que os escritores ficaram sem combustível para trama.

source: * {{Xenafication}}: When an effeminate and delicate female character is later upgraded into a full-fledged fighting badass, because it's considered more marketable to an audience.
pt_br: * Br/{{Xenaficacao}}: Uma personagem feminina e delicada é atualizada para se tornar uma combatente completa porque considera-se que isso é melhor aceito pelo público.

source: * {{Zeerust}}: Not a lot; the locations and props look generally plausible for a setting a mere 30+ years from the movie's release, but smartphones and portable tablets of any kind are conspicuously absent; actual phones as used in the movie have shrunk to streamlined earpieces similar to RealLife Bluetooth earpieces, but are not used in tandem with any tablets or screens.
pt_br: * ??? {{Zeerust}}: Não muito; os locais e objetos parecem geralmente plausíveis para uma ambientação de 30 anos no futuro em relação ao lançamento do filme, mas smartphones e tablets de qualquer tipo estão ausentes; os telefones como usados no filme encolheram para dispositivos auriculares parecidos com alguns dispositivos Bluetooth da Br/VidaReal, mas não são usados em conjunto com nenhum tablet ou tela.

source: ** "A Rixa de Popoca" introduces the titular character Popoca, who is a big, mean, tough bully boy that often resorts to violence with the other kids.
pt_br: ** "A Rixa de Popoca" apresenta o personagem titular Popoca, que é um garoto grande, malvado e durão que frequentemente é violento com os outros garotos.

source: ** "The Waffler" from the superhero tryout scene is played by a pre-fame Creator/DaneCook.
pt_br: ** "O Chapa", da sequência de seleção de heróis, é interpretado pelo BrCriador/DaneCook antes da fama.

source: ** "[[Franchise/StarWars May the forks be with us!]]" * ShoutOutToShakespeare: The Shoveler's RousingSpeech is reminiscent of the [[Theatre/HenryV 'band of brothers']] speech.
pt_br: * Br/UmSalveParaShakespeare: O Br/DiscursoEncorajante do Pá lembra em estilo o discurso do "pugilo de irmãos" em BrTeatro/HenriqueV.

source: ** ''Can Only Kill Part of Him'': FightingAShadow.
pt_br: ** ''Só É Possível Matar Parte Dele'': Br/LutandoContraUmaSombra.

source: ** ''Divine Protection'': The character itself is not a god, but can survive anything due to intervention of a favorable god/guardian angel/spirit of parent that has been [[AscendedToAHigherPlaneOfExistence 'struck down and become more powerful than you can possibly imagine']].
pt_br: ** ''Proteção Divina'': O personagem em si não é um deus, mas pode sobreviver a qualquer coisa devido à intervenção de um deus/anjo guardião/espírito ancestral que [[Br/AscenderParaUmPlanoSuperiorDaExistencia se tornou mais poderoso do que você pode imaginar]].

source: ** ''[[BeyondTheImpossible Impossibly Good Luck]]'': They charge headlong at a machine gun, and win.
pt_br: ** ''[[Br/AlemDoImpossivel Sorte Impossivelmente Boa]]'': Eles mergulham de cabeça na direção de uma metralhadora e saem vitoriosos.

source: ** ''[[BornAgainImmortality Rebirth]]'': Related to above, except when killed, they'll be reborn as an infant.
pt_br: ** ''[[Br/ImortalidadePorRenascimento Renascimento]]'': Relacionado ao item acima, mas quando mortos, eles renascem como pequenos.

source: ** ''[[BornLucky Dumb Luck/Crazy Luck]]'': The clumsy hero/heroine can dodge everything just because of extreme luck.
pt_br: ** ''[[Br/SortudoDeNascenca Sorte Insana]]'': O herói desajeitado consegue desviar de tudo por pura sorte.

source: ** ''[[OurGodsAreDifferent God]]'': Face it.
pt_br: ** ''[[Br/NossosDeusesSaoDiferentes Deus]]'': Admita.

source: ** ''[[WindsOfDestinyChange Making Their Own Luck]]'': Some characters literally have luck on their side, in the form of [[FormulaicMagic crunching the numbers]], [[PsychicPowers only seeming to be relying on luck]], [[PalsWithJesus having a friendship with the one setting the odds]] or [[RealityWarper actually changing them themselves]].
pt_br: ** ''[[Br/VentosDoDestinoMudem Fazendo A Própria Sorte]]'': Alguns personagens literalmente possuem a sorte ao seu lado, seja na forma de [[Br/MagiaFormulaica manipulação dos números]], [[Br/PoderesPsiquicos meramente aparentar estar dependendo da sorte]], [[Br/AmigosDeJesus ter uma amizade com quem quer que estabeleça as chances]] ou [[Br/DobradorDeRealidade alterando a própria realidade]].

source: ** ''[[YouCantKillWhatsAlreadyDead No Pain for the Undead]]'': Lack of pain is justified because the character is a member of the living dead.
pt_br: ** ''[[Br/VoceNaoPodeMatarOQueJaEstaMorto Mortos não sentem dor]]'': A falta de dor é justificada porque o personagem é parte dos mortos-vivos.

source: ** A LegacyCharacter looking for revenge.
pt_br: ** Um Br/PersonagemLegado que busca por vingança.

source: ** A MommasBoy who throws forks.
pt_br: ** Um Br/FilhinhoDaMamae que atira garfos.

source: ** A guy who thinks he's the [[ComicBook/TheIncredibleHulk Hulk]].
pt_br: ** Um cara que pensa que é o [[BrQuadrinhos/TheIncredibleHulk Hulk]].

source: ** A married man with a shovel.
pt_br: ** Um homem casado com uma pá.

source: ** A more straight example is when Spooner arrived at the spot Lanning's clues were leading him to [[spoiler: just as VIKI begins her ZerothLawRebellion]].
pt_br: ** Um exemplo mais claro ocorre quando Spooner chega no local para onde levam as pistas de Lanning, [[spoiler: no exato instante em que VIKI inicia sua Br/RebeliaoDaLeiZero]].

source: ** A shy teen with pointless invisibility powers.
pt_br: ** Um garoto tímido com poderes de invisibilidade inúteis.

source: ** A variation; Paçoca's real counterpart was obviously not named Paçoca, but he was also ''nicknamed'' that way due to having [[TrademarkFavoriteFood a strong liking to the brazilian candy of the same name]].
pt_br: ** Uma variação: a contraparte de Paçoca na vida real obviamente não se chama Paçoca, mas ele recebeu esse apelido devido a ter [[Br/ComidaPrediletaRegistrada um apreço forte por paçoca]].

source: ** Also Pencilhead and Son of Pencilhead.
pt_br: ** E também o Cabeça-de-Lápis e o Cabecinha-de-Lápis.

source: ** Also a somewhat odd example, as Spooner's main issue with the robots is that they run purely on programming.
pt_br: ** Em um exemplo estranho de certo modo, a cisma principal de Spooner com os robôs é que eles dependem puramente de programação.

source: ** Also, [[spoiler:the dangerous anti-robot manomachines are secured in a "security field" that a standard NS-5 touches...and it those parts get vaporized.
pt_br: ** Adicionalmente, [[spoiler: as nanomáquinas que desativam robôs ficam protegidas em um "campo de segurança" que um NS-5 padrão toca... e é instantaneamente vaporizado.

source: ** Also, the massive, wall-like NS-5 delivery trucks.
pt_br: ** Os caminhões enormes de transporte de NS-5.

source: ** Also, who he lives with at apartment #8 (the barrel is just his "secret hideout").
pt_br: ** As pessoas com quem ele mora na casa 8 (já que o barril é apenas um esconderijo).

source: ** Also, why shovels are the Shoveler's weapon; shoveling is what he does best.
pt_br: ** É o motivo pelo qual a pá é a arma do Pá: pazada é o que ele faz de melhor.

source: ** Alternatively, the person can be hit, but the proxy somehow takes all the damage instead.
pt_br: ** Alternativamente, a pessoa pode sofrer o golpe mas o substituto, de algum modo, recebe todo o dano.

source: ** Amazing's biggest problem isn't the fact he can't handle the crime, but he handles it ''too well''.
pt_br: ** O maior problema do Arraso não é ele não ser bom em combater o crime; na verdade ele o combate ''bem demais''.

source: ** An episode has an [[ImpliedTrope implied]] example.
pt_br: ** Um episódio tem um exemplo [[Br/TropoImplicado implicado]].

source: ** And Doña Nieves on a remake of that episode -- except she was Jeanne D'Arc.
pt_br: ** E Dona Neves fez o mesmo em uma refilmagem do episódio -- com a diferença de que ela era Joana D'Arc.

source: ** And [[spoiler: Spooner]], in a way.
pt_br: ** E [[spoiler: Spooner]], de certo modo.

source: ** And let's not forget Calvin's own ShowerScene later on, although there's plenty of CensorSteam surrounding her.
pt_br: ** E a própria Br/CenaDoChuveiro de Calvin, mas para ela há muito Br/VaporDeCensura disponível.

source: ** And then some: --->'''Sphinx:''' Your temper is very quick, my friend.
pt_br: ** E mais: --->'''Esfinge:''' Você tem o pavio bem curto, meu amigo.

source: ** And then, the last issue (not including the 2006 revival) has a story where Zuca has to carry a couch to the dump, but he gets too tired and exhausted, so he just throws the couch at a river instead, thinking it's harmless.
pt_br: ** A última edição (não considerando a de 2006) tem uma história onde Zuca precisa levar um sofá para o lixão, mas ele fica muito cansado, então ele apenas lança o sofá em um rio ao invés, pensando que não tem problema.

source: ** Another one for La Chilindrina: when the series started, her GirlishPigtails were really long, but during an episode from the 1973 season, Chavo cuts off her hair and makes her pigtails short.
pt_br: ** Outra para a Chiquinha: quando a série começou, o seu [[Br/MariaChiquinha penteado]] era longo, mas durante um episódio da temporada de 1973, Chaves corta o cabelo dela.

source: ** Asimov invented a fictional company called "United States Robots and Mechanical Men Corporation" and then a RealLife company decided to {{Defictionaliz|ation}}e it by naming themselves "U.S.
pt_br: ** Asimov inventou uma companhia fictícia chamada "U.S. Corporação de Robôs e Homens Mecânicos"[[note]]United States Robots and Mechanical Men Corporation[[/note]] e então uma empresa da Br/VidaReal decidiu [[Br/{{Desficcionalizacao}} desficcionalizá-la]] ao se dar o nome de "U.S.

source: ** At first, Pita is found sleeping outside his house; when asked about it, he says he is afraid of the dark of his bedroom at night.
pt_br: ** No começo, Pita é encontrado dormindo fora de casa; quando perguntado a respeito, ele diz que tem medo do escuro do quarto à noite.

source: ** Baldinho, who is the youngest of the group and is a toddler who barely can speak full sentences, is given a deep, WesternAnimation/JohnnyBravo-esque voice.
pt_br: ** Baldinho, que é o mais jovem do grupo e é um garoto que mal consegue falar frases completas, recebe uma voz grave no estilo de BrAnimacaoOcidental/JohnnyBravo.

source: ** Berkin tells Spooner that, as someone who hates robots, he was the right man for a murder case that wound up involving a robot.
pt_br: ** Berkin diz a Spooner que, como alguém que odeia robôs, ele era o cara certo para um caso de assassinato que acaba envolvendo um robô.

source: ** Beyond that, when Riobaldo tells her to say the same thing to Diadorim, she stays still, and Diadorim has a little jealous moment.
pt_br: ** Além disso, quando Riobaldo pede que ela diga a mesma coisa para Diadorim, ela permanece calada, e Diadorim tem um momento de ligeiro ciúme.

source: ** Binho's real-life counterpart is named Fábio, so his nickname is likely short for the other abbreviation, "Fabinho".
pt_br: ** A contraparte de Binho na vida real se chama Fábio, então seu apelido provavelmente é uma forma reduzida do nome alternativo, "Fabinho".

source: ** Blue Raja as Superego; obsessed with history and social conventions.
pt_br: ** O Marajá é o Superego, obcecado com história e convenções sociais.

source: ** BodyBackupDrive is the most extreme form of this, with a character being able to transfer their consciousness into a complete replacement ''body''.
pt_br: ** Br/CorpoReserva é a forma mais extrema disso, com um personagem conseguindo transferir completamente a consciência para um ''corpo'' substituto completo.

source: ** Both Doña Florinda and Doña Clotilde also faint when Quico brings a mouse in a bag.
pt_br: ** Dona Florinda e Dona Clotilde desmaiam em um episódio em que Quico traz um rato em uma sacola.

source: ** Both act as a respective MessianicArchetype for humanity and robots.
pt_br: ** Ambos agem como um Br/ArquetipoMessianico para a humanidade e para os robôs, respectivamente.

source: ** But if he/she can take at least one hit without repercussions, falling into BottomlessPits and/or getting SquashedFlat [[OneHitKill still instantly kills him/her]].
pt_br: ** Mas se ele/ela consegue aguentar pelo menos um ataque sem repercussões sérias, cair no Br/FossoSemFundo ou ser esmagado ainda vai causar morte instantânea.

source: ** Calvin's expression when her NS-5 tells her that the person who called just then was a wrong number-- ''after Calvin heard everything that Spooner said.'' ** After Spooner comments on the lack of military response to the robot uprising, Calvin says that the military has an exclusive contract with US-R.
pt_br: ** A expressão da Calvin quando o NS-5 dela diz que a pessoa que ligou para ela tinha sido do número errado -- ''depois de Calvin ter ouvido tudo que o Spooner disse.'' ** Após os comentários de Spooner sobre a falta de resposta militar ao levante dos robôs, Calvin diz que as forças armadas possuem um contrato exclusivo com a USR.

source: ** Captain Amazing says this word for word when asked how he knew about the Red-Eyes' attack on the nursing home.
pt_br: ** Capitão Arraso diz isso quase ''ipsis verbis'' quando perguntado como ele sabia do ataque na casa de repouso.

source: ** CaptainGeographic: A superhero with a name, outfit and/or characteristics based around their country of origin.
pt_br: ** Br/CapitaoGeografico: Um super herói com nome, traje e/ou características baseadas em seu país de origem.

source: ** CaptainPatriotic: A superhero serves the ideals of his nation.
pt_br: ** Br/CapitaoPatriota: Um super herói que serve aos ideais de sua nação.

source: ** CardCarryingVillain: Believing that the audience can't tell if a character is evil unless they openly take pride in how evil they are and/or refer to themselves as evil.
pt_br: ** Br/VilaoDeCrachaETudo: Acreditar que o público não vai conseguir identificar um personagem como mau a menos que ele se orgulhe de sua maldade e/ou referencie a si mesmo como sendo mau.

source: ** Casanova Frankenstein attacks with his ''one'' long pinkie nail, and the cast react just as if it were a full set of claws.
pt_br: ** Casanova Frankenstein ataca com a unha de ''um'' dos mindinhos e o grupo reage como se fosse um conjunto completo de garras.

source: ** Chavo (Gluttony), an orphaned humble kid, is very prone to thinking about or eating any kind of food that he comes across.
pt_br: ** Gula: Chaves, um garoto órfão humilde, sempre pensando em comida ou em comer qualquer comida que ele encontre.

source: ** Chavo is also prone to it, when people tick him off.
pt_br: ** O Chaves também é propenso a isso quando as pessoas o irritam.

source: ** Chilindrina bawls with a screechy ''"waah-waah-waaaaaaaaah"'' that can easily become a pain to hear.
pt_br: ** Chiquinha grita com um estridente ''"waah-waah-waaaaaaaaah"'' que rapidamente se torna desconfortável de ouvir.

source: ** ContinuityPorn annoying fans who get the nods and being [[BigLippedAlligatorMoment downright confusing and jarring]] to those who might not even know references are being made.
pt_br: ** Br/PornoDeContinuidade irritando fãs que entendem as referências e confundindo ou até mesmo chocando aqueles que nem sequer sabem que há uma referência sendo feita.

source: ** DamselOutOfDistress: A DamselInDistress who puts up a decent or successful escape from her captors, before the hero arrives.
pt_br: ** Br/DonzelaForaDePerigo: Uma Br/DonzelaEmPerigo que consegue elaborar e executar um plano de escape dos seus captores antes que o herói chegue.

source: ** Demonstrated with the weapon choices of Tony P's disco gang and {{lampshade|Hanging}}d by the heroes.
pt_br: ** Demonstrado com as armas escolhidas pelo Topete e a gangue dos Dançarinos, fato no qual os heróis [[Br/LancandoLuz lançam luz]]:

source: ** Despite Sonny obviously having a greater degree of autonomy and self-awareness than a standard NS-5, Robertson still wants to destroy him as an abomination that could destroy human trust in robots.
pt_br: ** Apesar de Sonny obviamente ter um grau maior de autonomia e percepção que um NS-5 convencional, Robertson ainda quer destruí-lo como se fosse uma abominação que pode colocar em risco a confiança nos robôs.

source: ** Don Ramón (Sloth) is very lazy trying to get a job for a living to make up for the delayed rent months he owes to his landlord, mostly trying to con his way out of doing so.
pt_br: ** Preguiça: Seu Madruga, pouco disposto a encontrar um emprego para pagar os aluguéis atrasados devidos ao proprietário e empenhado em dar um jeito de não precisar pagar.

source: ** Don Ramón uses it in the episode where Señor Barriga is trying to sell the vecindad to move due to heart problems.
pt_br: ** Seu Madruga usa isso no episódio em que o Senhor Barriga está tentando vender a vila para se mudar devido a um problema de saúde.

source: ** Don't mention how K had to leave his girlfriend behind when he joined the MIB organization.
pt_br: ** Não mencione que K precisou deixar a namorada para trás quando ele se juntou à MIB.

source: ** Doña Clotilde (Pride) initially starting out as a RichBitch and looking down on the children, to the point of even threatening them when they insult her.
pt_br: ** Soberba: Dona Clotilde, inicialmente apresentada como uma Br/CadelaRica que despreza as crianças, ao ponto de ameaçá-las quando elas a insultam.

source: ** Doña Clotilde is barely present in the final season after Don Ramón leaves.
pt_br: ** Dona Clotilde quase não aparece na temporada final depois da saída de Seu Madruga.

source: ** Doña Florinda and Profesor Jirafales (Lust) are madly in love with each other with their regular routine being brought up several times and in occasions having an AlmostKiss.
pt_br: ** Luxúria: Dona Florinda e Professor Girafales, apaixonados um pelo outro com suas interações aparecendo repetidas vezes e em algumas ocasiões tendo um Br/QuaseBeijo.

source: ** Doña Florinda, Type A. She's [[AlmightyMom harsh and outspoken]], but adores Quico and the mere sight of Jirafales makes her go all mushy.
pt_br: ** Dona Florinda é do tipo A. Ela é [[Br/MaeTodaPoderosa áspera e franca]], mas ama o Quico e a mera presença do Girafales faz com que ela se derreta.

source: ** Doña Nieves also cries in the exact same manner as her great granddaughter.
pt_br: ** Dona Neves também chora da mesma maneira que a sua neta.

source: ** During Spooner and Calvin's argument, he calls her "the dumbest smart person I have ''ever'' met in my life", to which she retorts that he's "the dumbest ''dumb'' person I've ever met".
pt_br: ** Durante a discussão entre Spooner e Calvin, ele diz que ela é "a pessoa inteligente mais teimosa que eu já conheci", no que ela retruca que ele é "a pessoa burra mais ''burra'' que eu já conheci".

source: ** During the episode where El Chavo gets a job as a waiter at Doña Florinda's restaurant, the mailman Jaimito at one point blows his whistle (which she tells him is what most mailmen do whenever they arrive) repeatedly inside the place when he came by to deliver a letter for her.
pt_br: ** Durante o episódio em que o Chaves trabalha no restaurante de Dona Florinda, o carteiro Jaiminho ao chegar assopra o apito (que ela diz que é o que os carteiros fazem ao chegar) repetidamente dentro do restaurante para entregar uma carta a ela.

source: ** Edgar, who's shown to be a spousal abuser (at least emotionally, and possibly physically as well) just before [[spoiler:the Bug kills him]].
pt_br: ** Edgar, que é mostrado como sendo um marido abusivo (pelo menos emocionalmente; talvez fisicamente) logo antes [[spoiler: de ser morto pelo Inseto]].

source: ** Edwards to K after K shoots Jeebs in the head, only to drop it when his head grows back.
pt_br: ** James para o K depois que ele atira na cabeça do Jeebs, largando ela quando a cabeça cresce novamente.

source: ** El Chavo sometimes for his excessive blindness towards lies.
pt_br: ** O Chaves, às vezes, por não enxergar as mentiras.

source: ** El Chavo's "aguas frescas" he made.
pt_br: ** O "refresco" que o Chaves fez.

source: ** Even if he never became a full-time character, Godinez began to appear slightly more often after Quico was gone.
pt_br: ** Mesmo que ele nunca tenha se tornado um personagem integral, o Godinez começou a aparecer com mais frequência depois da partida de Quico.
